# Content 
- [Preview](#preview)
- [Data formating](#section-1)
- [EDA](#subsection-11)
- [Data preparation](#subsection-12)
- [Merging tables](#section-2)
- [Encoding tables](#section-2)
- [The curse of dimensionality and PCA](#section-2)

<a id="preview"></a>

***

## Preview 
Take a quick look at both files in order to understand what we are going to work with, how data is stored and in which formats. Before uploading both files have been saved in different formats. CSV and XLSX. We can change the format of dictionary file from xlsx. to csv. manually by opening file in Excel and saving it as csv file. However the pandas library can read both formats. All we need to do is using operators read_csv for csv file and read_excel for xlsx file as it is shown below.

***

In [306]:
import pandas as pd

In [307]:
df_studens = pd.read_csv("student_data.csv")
df_dictionary = pd.read_excel("student_data_dictionary.xlsx")

***

Once files are read we can take a look how they a look like in order to understand what we are going to work with and which manupulations we need to do.

***

In [308]:
df_studens.head(5)

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,17,5,171.0,1,1,122.0,1,19,12.0,...,0,0.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,15,1,9254.0,1,1,160.0,1,1,3.0,...,0,6.0,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,9070.0,1,1,122.0,1,37,37.0,...,0,6.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,17,2,9773.0,1,1,122.0,1,38,37.0,...,0,6.0,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,39,1,8014.0,0,1,100.0,1,37,38.0,...,0,6.0,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [309]:
df_dictionary.head(50)

,Variable Name,Role,Type,Demographic,Description,Units
0,Marital Status,Feature,Integer,Marital Status,1 â€“ single 2 â€“ married 3 â€“ widower 4 â€“ divorce...,NaN
1,Application mode,Feature,Integer,NaN,1 - 1st phase - general contingent 2 - Ordinan...,NaN
2,Application order,Feature,Integer,NaN,Application order (between 0 - first choice; a...,NaN
3,Course,Feature,Integer,NaN,33 - Biofuel Production Technologies 171 - Ani...,NaN
4,Daytime/evening attendance,Feature,Integer,NaN,1 â€“ daytime 0 - evening,NaN
5,Previous qualification,Feature,Integer,Education Level,1 - Secondary education 2 - Higher education -...,NaN
6,Previous qualification (grade),Feature,Continuous,NaN,Grade of previous qualification (between 0 and...,NaN
7,Nacionality,Feature,Integer,Nationality,1 - Portuguese; 2 - German; 6 - Spanish; 11 - ...,NaN
8,Mother's qualification,Feature,Integer,Education Level,1 - Secondary Education - 12th Year of Schooli...,NaN
9,Father's qualification,Feature,Integer,Education Level,1 - Secondary Education - 12th Year of Schooli...,NaN
10,Mother's occupation,Feature,Integer,Occupation,0 - Student 1 - Representatives of the Legisla...,NaN
11,Father's occupation,Feature,Integer,Occupation,0 - Student 1 - Representatives of the Legisla...,NaN
12,Admission grade,Feature,Continuous,NaN,Admission grade (between 0 and 200),NaN
13,Displaced,Feature,Integer,NaN,1 â€“ yes 0 â€“ no,NaN
14,Educational special needs,Feature,Integer,NaN,1 â€“ yes 0 â€“ no,NaN
15,Debtor,Feature,Integer,NaN,1 â€“ yes 0 â€“ no,NaN
16,Tuition fees up to date,Feature,Integer,NaN,1 â€“ yes 0 â€“ no,NaN
17,Gender,Feature,Integer,Gender,1 â€“ male 0 â€“ female,NaN
18,Scholarship holder,Feature,Integer,NaN,1 â€“ yes 0 â€“ no,NaN
19,Age at enrollment,Feature,Integer,Age,Age of studend at enrollment,NaN
20,International,Feature,Integer,NaN,1 â€“ yes 0 â€“ no,NaN
21,Curricular units 1st sem (credited),Feature,Integer,NaN,Number of curricular units credited in the 1st...,NaN
22,Curricular units 1st sem (enrolled),Feature,Integer,NaN,Number of curricular units enrolled in the 1st...,NaN
23,Curricular units 1st sem (evaluations),Feature,Integer,NaN,Number of evaluations to curricular units in t...,NaN
24,Curricular units 1st sem (approved),Feature,Integer,NaN,Number of curricular units approved in the 1st...,NaN
25,Curricular units 1st sem (grade),Feature,Integer,NaN,Grade average in the 1st semester (between 0 a...,NaN
26,Curricular units 1st sem (without evaluations),Feature,Integer,NaN,Number of curricular units without evalutions ...,NaN
27,Curricular units 2nd sem (credited),Feature,Integer,NaN,Number of curricular units credited in the 2nd...,NaN
28,Curricular units 2nd sem (enrolled),Feature,Integer,NaN,Number of curricular units enrolled in the 2nd...,NaN
29,Curricular units 2nd sem (evaluations),Feature,Integer,NaN,Number of evaluations to curricular units in t...,NaN
30,Curricular units 2nd sem (approved),Feature,Integer,NaN,Number of curricular units approved in the 2nd...,NaN
31,Curricular units 2nd sem (grade),Feature,Integer,NaN,Grade average in the 2nd semester (between 0 a...,NaN
32,Curricular units 2nd sem (without evaluations),Feature,Integer,NaN,Number of curricular units without evalutions ...,NaN
33,Unemployment rate,Feature,Continuous,NaN,Unemployment rate (%),NaN
34,Inflation rate,Feature,Continuous,NaN,Inflation rate (%),NaN
35,GDP,Feature,Continuous,NaN,GDP,NaN
36,Target,Target,Categorical,NaN,Target. The problem is formulated as a three c...,NaN

***

It looks that initial dataset was devided into a two parts or data was being collected in this way in a first place. The main table contains foreign keys which connect a specific cell with a defenition in the second table. The second table contains primary keys for main table. I may suggest that those tables are called relational database, and using this method for storing data in this case has several advantages:
1. This method saves memory in tables with multiple repetitions.
2. It can keep data private and secure, without enclosing personal data.
3. This approach helps to get red of potential bias or at least to reduce it. For instance, if some company or department publishes a dataset they can substitute information which may be misinterpretted using keys, and keep table with definitions unpublished.

***

In [310]:
df_studens.describe()

,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 1st sem (without evaluations),Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP
count,4424.000000,4424.000000,4423.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4423.000000,4424.000000,...,4424.000000,4424.000000,4423.000000,4424.000000,4424.000000,4423.000000,4424.000000,4424.000000,4424.000000,4424.000000
mean,18.669078,1.727848,8856.458738,0.890823,4.577758,132.613314,1.873192,19.561935,22.271987,10.960895,...,0.137658,0.541817,6.231743,8.063291,4.435805,10.229941,0.150316,11.566139,1.228029,0.001969
std,17.484682,1.313793,2063.763479,0.311897,10.216592,13.188332,6.914514,15.603186,15.343244,26.418253,...,0.690880,1.918546,2.196038,3.947951,3.014764,5.211367,0.753774,2.663850,1.382711,2.269935
min,1.000000,0.000000,33.000000,0.000000,1.000000,95.000000,1.000000,1.000000,1.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,7.600000,-0.800000,-4.060000
25%,1.000000,1.000000,9085.000000,1.000000,1.000000,125.000000,1.000000,2.000000,3.000000,4.000000,...,0.000000,0.000000,5.000000,6.000000,2.000000,10.750000,0.000000,9.400000,0.300000,-1.700000
50%,17.000000,1.000000,9238.000000,1.000000,1.000000,133.100000,1.000000,19.000000,19.000000,5.000000,...,0.000000,0.000000,6.000000,8.000000,5.000000,12.200000,0.000000,11.100000,1.400000,0.320000
75%,39.000000,2.000000,9556.000000,1.000000,1.000000,140.000000,1.000000,37.000000,37.000000,9.000000,...,0.000000,0.000000,7.000000,10.000000,6.000000,13.333333,0.000000,13.900000,2.600000,1.790000
max,57.000000,9.000000,9991.000000,1.000000,43.000000,190.000000,109.000000,44.000000,44.000000,194.000000,...,12.000000,19.000000,23.000000,33.000000,20.000000,18.571429,12.000000,16.200000,3.700000,3.510000

In [311]:
df_studens.dtypes

Marital status                                     object
Application mode                                    int64
Application order                                   int64
Course                                            float64
Daytime/evening attendance                          int64
Previous qualification                              int64
Previous qualification (grade)                    float64
Nacionality                                         int64
Mother's qualification                              int64
Father's qualification                            float64
Mother's occupation                                 int64
Father's occupation                                 int64
Admission grade                                   float64
Displaced                                          object
Educational special needs                           int64
Debtor                                            float64
Tuition fees up to date                            object
Gender                                              int64
Scholarship holder                                  int64
Age at enrollment                                  object
International                                     float64
Curricular units 1st sem (credited)                object
Curricular units 1st sem (enrolled)                 int64
Curricular units 1st sem (evaluations)              int64
Curricular units 1st sem (approved)                 int64
Curricular units 1st sem (grade)                  float64
Curricular units 1st sem (without evaluations)      int64
Curricular units 2nd sem (credited)                 int64
Curricular units 2nd sem (enrolled)               float64
Curricular units 2nd sem (evaluations)              int64
Curricular units 2nd sem (approved)                 int64
Curricular units 2nd sem (grade)                  float64
Curricular units 2nd sem (without evaluations)      int64
Unemployment rate                                 float64
Inflation rate                                    float64
GDP                                               float64
Target                                             object
dtype: object

Some columns were not included in the statistic summary due to they have a format object and can not be recognised despite being a numeric values. However in our case it is even better for us. Futhermore we had better to format others columns in the same object format.

In [312]:
unique_course = df_studens['Course'].unique()
print(unique_course)

[ 171. 9254. 9070. 9773. 8014. 9991. 9500. 9238. 9670. 9853. 9085. 9130.
 9556. 9147. 9003.   33. 9119.   nan]

In [313]:
unique_Marital_status = df_studens['Marital status'].unique()
print(unique_Marital_status)

['1' '2' '4' '?' '3' '5' '6']

As we can see some of features contain foreign key for second dataset and some of them contain numerical value such as columns "Unemployment rate" or "GDP". in this case we need identify columns which are supposed to contain keys and columns with numerical values. All keys in the student table must be perceived as objects format.
Also we can notice that some of the columns contain symbols which are mentioned in dictionary file such as "?" in the "Marital status" or "nan" in the column "Course". Removing rows which contain those symbols may helps to process the data, however the issue can be deeper.
1. The symbols which we may identify as errors may be keys and serve to connect cells between two tables. Even in this case in may be challanging and time consuming to compare those keys manually.
2. Also there may be the opposite situation, when we include in our analysis keys which actually dont have a defenition in a dictionary.
For example if we have a table with employees ID and departments and we want to summarise the quantity of employees in each department. We may include people who already left the company or ID was generated by accident and table was not updated timely. 

I see three approaches for further data preparation process:

1. Identify features which contain foreign keys, format them as a string and treat them as a string values such as ID. It will allow us to do EDA and analyses. Additionally this approach will save time for operations, memory and computing power. However there may be a problem with quality of our EDA and with a futher interpritation. 
2. Merging datasets. Substitute foreign keys with their definitions. It will allow us to identify missing values even if cells contain values. For example, if the column "Marital status" will contain single numerical values after merging we will be able to assign them as "Unknown" category. However, the size of the file with database will grow, with means more memory, computing power and time for code to run will be spent.
3. Mixed approach which I am going to use. Technically, we can merge data, make a data preparation proccess. And after devide data back. This apporoach may be helpful if we want to save resourses and perform proper preparation process. However, this method requires many manipulations with data.

Now we are able to create a plan which provides the order of operation we need to get done:

1. Transform dictionary table.
We need to extract all foreign keys from the dictionary file and store them separately where each table will define keys for specific column. It may be challenging because all keys from each column are placed in the same cell without any delimitation. To fix that we will use library "re" which provides syntax for identifying a patterns.
2. Merging datasets
Tables we are going to extract from dictionary dataset will be merged with student dataset.
3. EDA and data preparation.
After compliting previos stages we will be able to identify and process all issues with data set.
4. Transforming back.
If those tables being stored separatly I can assume there is a reason for that. As I mentioned before it may be for saving space, computing power, ethical and confidential policy or different reason. So, I think it is important to format datasets back after tidying them up. Additionally, properly cleaned and stored database will make it much easier to operate it in the future.

### The curse of dimensionality and PCA

The curse of dimensionality presents an issue related to a number of possible variantion within a data set.
Each feature in a dataset reflects a dimension where data is being placed. As far as I understand it is called "the curse" because both computer's and human's abilitis of making calculations are limited. And although computers have thousands times more computing power than human's brain, is still may be difficult for them to perform some work. So the curse is hidden in large number of varientions which computer must compare to each another. Another inconvenience may be about visualisating data. Computers are not limited in their "perception" with three dimensional world like humans. However it may be difficult to demonstrate data with more than 3-5 dimentions. For example we can create only 3-axis graph and place objects inside with different shape, color and size. In this case even a graph with 6 dimensions is already overwhelmed for an effective reading.

For example if I go to the store for buying a bottle of milk:
- 0 dimentions:
There is just one bottle for entire store, I will get without any hesitations. Just because I don't have any other options I don't have to decide or compare.
- 1 dimention:
There are some brends that selling the same milk for slightly different prises. It also quite simple, but now I need choose, in other words make a simple calculation which will provide conclution.
- 2 dimentions:
This time I coming to the store and I can see that now companies got obligated to print expiry date which already requires staring at the shelfs for a while and making a conclusion about the best deal.
- 3 dimentions: 
In this case buying a bottle of milk will require having a diploma in mathematics because companies added different precentage of fat. Make this calculation very difficult because most of the features collerate to each other. But there may thousands of feachers with makes it impossible to make analysis.
- 4+ dimentions:
As we can see each new dimension adds a power for initual set that means an exponential growth of variations.

I think all of us have ever experienced the curse of dimensionality. It may be very stressful, because human's abilitis are very limited, but sometimes we need to find the best option or way with hundreds or thousands varietions. For example, buying a house or a car, choosing a carier or a college, exploring potential spots for holidays or picking a recipe for dinner. All of those require some calculation.

However, both computer science and the market has developed a solution for this problem. In computer sience it is called PCA Principal Component Analysis. This method allows to capture the most relevant for dataset features and place them in two-dimensional scale. It is very useful tool which helps to save memory by reducing number of feachers with less important and desreasing requirements for calculating power.

In terms of the market, PCA may be perceived as a agencies in some spacific industy. If I want/can buy a house, I go to a real estate agency and give them the most relevant for me featers of the house, such as range of price, location, condition, size. Based on principal components I provided agency reduces general number of houses avalable and summarise for me only those ones which resonate with my preferences.

PCA in prediction model works in similar way. It reduce a number of records by creating the avarage values which represent the whole sample with similar accuracy.

For example a company has a database with a sample which represents general population of their clients. The sample has 100k records about cliens data like (age, gender, hobbies, food preferences...). In this case they can consider that sample as general population and extract smaller sample with appropriate accuracy.

## Data separating

The aim of this stage is dividing dictionary dataset into separate table which will provide defenitions for table with student data.

After several attempts it was established that row data in the cells which contains keys and their defenitions has no delimitation. Considering it we need to use library re which provides a syntax for determining delimiters manually.

In [314]:
import pandas as pd
import re

def replace_text(text):  
    text = text.replace("No. ", "No.")
    text = text.replace("â€“", "-")
    return text

original_table = pd.read_excel("student_data_dictionary.xlsx")

row_index = 1
column_name = 'Description'

text = original_table.at[row_index, column_name]

text = replace_text(text)
print(text)

1 - 1st phase - general contingent 2 - Ordinance No.612/93 5 - 1st phase - special contingent (Azores Island) 7 - Holders of other higher courses 10 - Ordinance No.854-B/99 15 - International student (bachelor) 16 - 1st phase - special contingent (Madeira Island) 17 - 2nd phase - general contingent 18 - 3rd phase - general contingent 26 - Ordinance No.533-A/99, item b2) (Different Plan) 27 - Ordinance No.533-A/99, item b3 (Other Institution) 39 - Over 23 years old 42 - Transfer 43 - Change of course 44 - Technological specialization diploma holders 51 - Change of institution/course 53 - Short cycle diploma holders 57 - Change of institution/course (International)

The biggest challange in this stage is defining a patters which will capture element in a exact order which we need and without loosing data. For sipmplifing this task I decreased number of variebles which need to be included in pattern by deleting an extra space in one of the elements in the previos cell.
After getting pattern, we create a new variable and store there all elements.

In [315]:
pattern2 = r'(\d+)\s*-\s*(.*?)\s(?=\d+\s*-|\Z)'
pattern = r'(\d+)\s*-\s*(.*?)\s*(?=\d+\s*-|\Z)'

matches = re.findall(pattern2, text)
print(matches)

[('1', '1st phase - general contingent'), ('2', 'Ordinance No.612/93'), ('5', '1st phase - special contingent (Azores Island)'), ('7', 'Holders of other higher courses'), ('10', 'Ordinance No.854-B/99'), ('15', 'International student (bachelor)'), ('16', '1st phase - special contingent (Madeira Island)'), ('17', '2nd phase - general contingent'), ('18', '3rd phase - general contingent'), ('26', 'Ordinance No.533-A/99, item b2) (Different Plan)'), ('27', 'Ordinance No.533-A/99, item b3 (Other Institution)'), ('39', 'Over 23 years old'), ('42', 'Transfer'), ('43', 'Change of course'), ('44', 'Technological specialization diploma holders'), ('51', 'Change of institution/course'), ('53', 'Short cycle diploma holders')]

The cell which represents key feature "Application mode" contains symbols which can't be recognised by pattern. so we have modifed that pattern and stored it as a pattern2. Futher we will apply a loop for separating data using pattern1 which works with the most of the cells.
As we can see data was stored properly.
So now we need create a list and name the featuers for further storing.

In [316]:
data = [{'Key': match[0], 'Definition': match[1]} for match in matches]
print(data)

[{'Key': '1', 'Definition': '1st phase - general contingent'}, {'Key': '2', 'Definition': 'Ordinance No.612/93'}, {'Key': '5', 'Definition': '1st phase - special contingent (Azores Island)'}, {'Key': '7', 'Definition': 'Holders of other higher courses'}, {'Key': '10', 'Definition': 'Ordinance No.854-B/99'}, {'Key': '15', 'Definition': 'International student (bachelor)'}, {'Key': '16', 'Definition': '1st phase - special contingent (Madeira Island)'}, {'Key': '17', 'Definition': '2nd phase - general contingent'}, {'Key': '18', 'Definition': '3rd phase - general contingent'}, {'Key': '26', 'Definition': 'Ordinance No.533-A/99, item b2) (Different Plan)'}, {'Key': '27', 'Definition': 'Ordinance No.533-A/99, item b3 (Other Institution)'}, {'Key': '39', 'Definition': 'Over 23 years old'}, {'Key': '42', 'Definition': 'Transfer'}, {'Key': '43', 'Definition': 'Change of course'}, {'Key': '44', 'Definition': 'Technological specialization diploma holders'}, {'Key': '51', 'Definition': 'Change of institution/course'}, {'Key': '53', 'Definition': 'Short cycle diploma holders'}]

In [317]:
student_data1 = pd.DataFrame()
student_data1 = pd.concat([student_data1, pd.DataFrame(data)], ignore_index=True)
student_data1.head(30)

   Key                                         Definition
0    1                     1st phase - general contingent
1    2                                Ordinance No.612/93
2    5     1st phase - special contingent (Azores Island)
3    7                    Holders of other higher courses
4   10                              Ordinance No.854-B/99
5   15                   International student (bachelor)
6   16    1st phase - special contingent (Madeira Island)
7   17                     2nd phase - general contingent
8   18                     3rd phase - general contingent
9   26   Ordinance No.533-A/99, item b2) (Different Plan)
10  27  Ordinance No.533-A/99, item b3 (Other Institut...
11  39                                  Over 23 years old
12  42                                           Transfer
13  43                                   Change of course
14  44       Technological specialization diploma holders
15  51                       Change of institution/course
16  53                        Short cycle diploma holders

As a result we have got a table which represents defenition for each key in the student table.
We can store that table as a variable and work with that table directly or firstly we store save it as a csv file. I think second approach will help for further work. We are going to name tables after columns they represent, it will help us not only getting lost in multiple tables and but also merge data.

In [318]:
import os
folder_path = '/Users/iliagrishkin/Assignments/Data preparation/Prepared tables'
os.makedirs(folder_path)

In [319]:
column_name2 = 'Variable Name'
table_name = original_table.at[row_index, column_name2]
file_path = os.path.join(folder_path, f"{table_name}.csv")
student_data1.to_csv(file_path, index=False)
print(table_name)

Application mode

Once we made sure that table was stored properly we can write a loop function which will perform the same operation with each cell. However before that we need to take a look at our dictionary table at identify rows which contain keys and make a list of them.

In [320]:
specific_row_indices = [0, 3, 5, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 20]

We excluded two records from the list (1, 4). First one because we already stored data by applying different pattern. The second one because the name of column contains symbols from python syntax where "/" is recognised as path. However I think we should change the name before we launch the loop.

In [321]:
original_table = pd.read_excel("student_data_dictionary.xlsx")

row_index = 4
column_name = 'Description'

text = original_table.at[row_index, column_name]
text = replace_text(text)
pattern = r'(\d+)\s*-\s*(.*?)\s*(?=\d+\s*-|\Z)'
matches = re.findall(pattern, text)
data = [{'Key': match[0], 'Definition': match[1]} for match in matches]
student_data1 = pd.DataFrame()
student_data1 = pd.concat([student_data1, pd.DataFrame(data)], ignore_index=True)

def change_name(text):  
    text = text.replace("/", "-")
    return text

column_name2 = 'Variable Name'

text = original_table.at[row_index, column_name2]

text = change_name(text)
    
filename = f"{text}"

file_path = os.path.join(folder_path, f"{filename}.csv")
student_data1.to_csv(file_path, index=False)

print(f"'{filename}'created")

'Daytime-evening attendance'created

In [322]:
for row_index in specific_row_indices:
    
    text = original_table.at[row_index, column_name]
    text = replace_text(text)
    pattern = r'(\d+)\s*-\s*(.*?)\s*(?=\d+\s*-|\Z)'

    matches = re.findall(pattern, text)

    data = [{'Key': match[0], 'Definition': match[1]} for match in matches]
    student_data1 = pd.DataFrame(data)

    table_name = original_table.at[row_index, column_name2]
    
    filename = f"{table_name}"

    file_path = os.path.join(folder_path, f"{filename}.csv")
    student_data1.to_csv(file_path, index=False)

    print(f"'{filename}'created")

'Marital Status'created
'Course'created
'Previous qualification'created
'Nacionality'created
'Mother's qualification'created
'Father's qualification'created
'Mother's occupation'created
'Father's occupation'created
'Displaced'created
'Educational special needs'created
'Debtor'created
'Tuition fees up to date'created
'Gender'created
'Scholarship holder'created
'International'created

In [324]:
df_International = pd.read_csv("/Users/iliagrishkin/Assignments/Data preparation/Prepared tables/International.csv")
df_International.head(10)

   Key Definition
0    1        yes
1    0         no

In [325]:
df_Fathers_qualification = pd.read_csv("/Users/iliagrishkin/Assignments/Data preparation/Prepared tables/Father's qualification.csv")
df_Fathers_qualification.head(10)

   Key                                         Definition
0    1  Secondary Education - 12th Year of Schooling o...
1    2               Higher Education - Bachelor's Degree
2    3                          Higher Education - Degree
3    4                        Higher Education - Master's
4    5                       Higher Education - Doctorate
5    6                      Frequency of Higher Education
6    9             12th Year of Schooling - Not Completed
7   10             11th Year of Schooling - Not Completed
8   11                                     7th Year (Old)
9   12                     Other - 11th Year of Schooling

As we can see we successfully prepared data for our next stage.

## Merging tables

### Preparation

In [326]:
import os
files = os.listdir(folder_path)
print(files)

['Gender.csv', 'International.csv', 'Tuition fees up to date.csv', 'Course.csv', "Mother's occupation.csv", 'Scholarship holder.csv', 'Debtor.csv', 'Previous qualification.csv', 'Nacionality.csv', "Father's qualification.csv", "Mother's qualification.csv", "Father's occupation.csv", 'Daytime-evening attendance.csv', 'Educational special needs.csv', 'Displaced.csv', 'Application mode.csv', 'Marital Status.csv']

In [327]:
import pandas as pd

def get_unique_values(df_studens, specific_row_indices):
    unique_values_dict = {}
    for col_index in specific_row_indices:
        column_name = df_studens.columns[col_index]
        unique_values = df_studens.iloc[:, col_index].unique()
        unique_values_dict[column_name] = unique_values
    return unique_values_dict

unique_values = get_unique_values(df_studens, specific_row_indices)

for column_name, values in unique_values.items():
    print(f"Column '{column_name}' unique values:")
    print(values)
    print()

Column 'Marital status' unique values:
['1' '2' '4' '?' '3' '5' '6']

Column 'Course' unique values:
[ 171. 9254. 9070. 9773. 8014. 9991. 9500. 9238. 9670. 9853. 9085. 9130.
 9556. 9147. 9003.   33. 9119.   nan]

Column 'Previous qualification' unique values:
[ 1 19 42 39 10  3 40  2  4 12 43 15  6  9 38  5 14]

Column 'Nacionality' unique values:
[  1  62   6  41  26 103  13  25  21 101  11  22  32 100  24 109   2 108
 105  14  17]

Column 'Mother's qualification' unique values:
[19  1 37 38  3  4 42  2 34 12 40  9  5 39 11 41 30 14 35 36  6 10 29 43
 18 22 27 26 44]

Column 'Father's qualification' unique values:
[12.  3. 37. 38.  1. 19.  5.  4. 34.  2. 39. 11.  9. nan 36. 26. 40. 14.
 20. 35. 41. 22. 13. 29. 43. 18. 42. 10.  6. 30. 25. 44. 33. 27. 31.]

Column 'Mother's occupation' unique values:
[  5   3   9   7   4   1 125   0   6   2  90   8 141 175  99 191 151 194
 192 132 152 134  10 143 123 173 193 122 144 131 171 153]

Column 'Father's occupation' unique values:
[  9   3   7  10   5   8   4   1   2 124   6   0  90 175 121  99 144 195
 192 161 193 151 182 132 131 194 163 135 143 171 103 172 152 183 122 102
 181 134 123 112 153 174 141 114 101 154]

Column 'Displaced' unique values:
['1' '0' '?']

Column 'Educational special needs' unique values:
[0 1]

Column 'Debtor' unique values:
[ 0.  1. nan]

Column 'Tuition fees up to date' unique values:
['1' '0' 'None' '?']

Column 'Gender' unique values:
[1 0]

Column 'Scholarship holder' unique values:
[0 1]

Column 'International' unique values:
[ 0.  1. nan]

In [328]:
df_studens['Marital status'] = df_studens['Marital status'].replace('?', 404)

In [329]:
df_studens['Displaced'] = df_studens['Displaced'].replace('?', 404)

In [330]:
df_studens['Tuition fees up to date'] = df_studens['Tuition fees up to date'].replace('?', 404)

In [331]:
df_studens['Tuition fees up to date'] = df_studens['Tuition fees up to date'].replace('None', 404)

In [332]:
df_studens2 = df_studens
df_studens2 = df_studens.fillna(404)

In [333]:

def get_unique_values(df_studens2, specific_row_indices):
    unique_values_dict = {}
    for col_index in specific_row_indices:
        column_name = df_studens2.columns[col_index]
        unique_values = df_studens2.iloc[:, col_index].unique()
        unique_values_dict[column_name] = unique_values
    return unique_values_dict

unique_values = get_unique_values(df_studens2, specific_row_indices)

for column_name, values in unique_values.items():
    print(f"Column '{column_name}' unique values:")
    print(values)
    print()

Column 'Marital status' unique values:
['1' '2' '4' 404 '3' '5' '6']

Column 'Course' unique values:
[ 171. 9254. 9070. 9773. 8014. 9991. 9500. 9238. 9670. 9853. 9085. 9130.
 9556. 9147. 9003.   33. 9119.  404.]

Column 'Previous qualification' unique values:
[ 1 19 42 39 10  3 40  2  4 12 43 15  6  9 38  5 14]

Column 'Nacionality' unique values:
[  1  62   6  41  26 103  13  25  21 101  11  22  32 100  24 109   2 108
 105  14  17]

Column 'Mother's qualification' unique values:
[19  1 37 38  3  4 42  2 34 12 40  9  5 39 11 41 30 14 35 36  6 10 29 43
 18 22 27 26 44]

Column 'Father's qualification' unique values:
[ 12.   3.  37.  38.   1.  19.   5.   4.  34.   2.  39.  11.   9. 404.
  36.  26.  40.  14.  20.  35.  41.  22.  13.  29.  43.  18.  42.  10.
   6.  30.  25.  44.  33.  27.  31.]

Column 'Mother's occupation' unique values:
[  5   3   9   7   4   1 125   0   6   2  90   8 141 175  99 191 151 194
 192 132 152 134  10 143 123 173 193 122 144 131 171 153]

Column 'Father's occupation' unique values:
[  9   3   7  10   5   8   4   1   2 124   6   0  90 175 121  99 144 195
 192 161 193 151 182 132 131 194 163 135 143 171 103 172 152 183 122 102
 181 134 123 112 153 174 141 114 101 154]

Column 'Displaced' unique values:
['1' '0' 404]

Column 'Educational special needs' unique values:
[0 1]

Column 'Debtor' unique values:
[  0.   1. 404.]

Column 'Tuition fees up to date' unique values:
['1' '0' 404]

Column 'Gender' unique values:
[1 0]

Column 'Scholarship holder' unique values:
[0 1]

Column 'International' unique values:
[  0.   1. 404.]

First of all we need to assign one more category for each table with primary keys we have just created. This key will represent all missing values.

In [334]:
new_record = {'Key': '404', 'Definition': 'Unknown'} 
for file in files:
    file_path = os.path.join(folder_path, file)
    df = pd.read_csv(file_path)
    df = df.append(new_record, ignore_index=True)
    df.to_csv(file_path, index=False)

/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)
/var/folders/xv/rzvgqjxn6p91h8mbll11tgzw0000gn/T/ipykernel_83088/2064733054.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_record, ignore_index=True)

### Merging

In [247]:
df_Marital_status = pd.read_csv('/Users/iliagrishkin/Assignments/Data preparation/Prepared tables/Marital status.csv')

In [248]:
df_Marital_status.head(10)

   Marital status                Key
0               1             single
1               2            married
2               3            widower
3               4           divorced
4               5        facto union
5               6  legally separated
6             404            Unknown

In [253]:
df_studens2.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,17,5,171.0,1,1,122.0,1,19,12.0,...,0,0.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,15,1,9254.0,1,1,160.0,1,1,3.0,...,0,6.0,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,9070.0,1,1,122.0,1,37,37.0,...,0,6.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,17,2,9773.0,1,1,122.0,1,38,37.0,...,0,6.0,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,39,1,8014.0,0,1,100.0,1,37,38.0,...,0,6.0,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [275]:
df_studens2['Marital status'] = df_studens2['Marital status'].astype(int)

In [278]:
merged_df = df_studens2.merge(df_Marital_status, on='Marital status', how='left') 

merged_df.head(5)

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target,Key
0,1,17,5,171.0,1,1,122.0,1,19,12.0,...,0.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout,single
1,1,15,1,9254.0,1,1,160.0,1,1,3.0,...,6.0,6,6,13.666667,0,13.9,-0.3,0.79,Graduate,single
2,1,1,5,9070.0,1,1,122.0,1,37,37.0,...,6.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout,single
3,1,17,2,9773.0,1,1,122.0,1,38,37.0,...,6.0,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate,single
4,2,39,1,8014.0,0,1,100.0,1,37,38.0,...,6.0,6,6,13.000000,0,13.9,-0.3,0.79,Graduate,married

In [274]:
print(df_Marital_status.dtypes)

Marital status     int64
Key               object
dtype: object

In [258]:
merged_df.head(10)

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target,Key
0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,single
1,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,married
2,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,widower
3,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,divorced
4,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,facto union
5,6.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,legally separated
6,404.0,43.0,1.0,9853.0,1.0,1.0,115.0,1.0,3.0,37.0,...,6.0,12.0,3.0,10.0,0.0,9.4,-0.8,-3.12,Dropout,Unknown

In [237]:
df_Marital_status.head(10)

   Key         Definition
0    1             single
1    2            married
2    3            widower
3    4           divorced
4    5        facto union
5    6  legally separated
6  404            Unknown

In [305]:
new_column_names = df_studens.columns[specific_row_indices]
print(new_column_names)

Index(['Marital status', 'Course', 'Previous qualification', 'Nacionality',
       'Mother's qualification', 'Father's qualification',
       'Mother's occupation', 'Father's occupation', 'Displaced',
       'Educational special needs', 'Debtor', 'Tuition fees up to date',
       'Gender', 'Scholarship holder', 'International'],
      dtype='object')